my_num = int(input("Введите ваше число: ")) # 100
print("Двоичное представление числа {num} это {num:b}".format(num=my_num))
print("Восьмеричное представление числа {num} это {num:o}".format(num=my_num))
print("Десятичное представление числа {num} это {num:d}".format(num=my_num))
print("Шестнадцатеричное представление числа {num} это {num:x}".format(num=my_num))
print("Юникод представление числа {num} это {num:c}".format(num=my_num))

# Введите ваше число: 100
# Двоичное представление числа 100 это 1100100
# Восьмеричное представление числа 100 это 144
# Десятичное представление числа 100 это 100
# Шестнадцатеричное представление числа 100 это 64
# Юникод представление числа 100 это d
